//HERC03T  JOB  MSGCLASS=H,NOTIFY=HERC03,USER=HERC03,PASSWORD=PASS4U
//VERTASM  EXEC PROC=VERTASM,PGMNAME='TELLER'
//RUN      EXEC PROC=RUN,PGMNAME='TELLER'
