//HERC03T JOB  MSGCLASS=H,NOTIFY=HERC03
//STEP1  EXEC ASMFCLG
//SYSIN  DD *
R0       EQU 0
R1       EQU 1
R2       EQU 2
R3       EQU 3
R4       EQU 4
R5       EQU 5
R6       EQU 6
R7       EQU 7
R8       EQU 8
R9       EQU 9
R10      EQU 10
R11      EQU 11
R12      EQU 12
R13      EQU 13
R14      EQU 14
R15      EQU 15
ONBB     DS    CL5
***********************************************************************
PGM1     CSECT
         SAVE  (14,12)               SLA DE REGISTERS VAN DE AANROEP OP
         BALR  R12,0                      STEL R12 IN ALS BASISREGISTER
         USING *,R12                              GEBRUIK R12 ALS BASIS
         LA    R2,SAVEAREA                  ADRES VAN MIJN OPSLAGGEBIED
         ST    R2,8(,R13)                OPSLAAN GEHEUGEN ADRES R13 + 8
         ST    R13,SAVEAREA+4         WAARDE VAN R13 ADRES SAVEAREA + 4
         LR    R13,R2                   STEL 13 IN OP MIJN SUB-OPROEPEN
***********************************************************************
*        MVC   ONBB,=C'12345'
         MVC   DATA2,DATA1
         LA    R2,5
         STH   R2,LEN
         LA    R2,MYDATA
         WTO   TEXT=(R2)
***********************************************************************
EINDE    L     R13,SAVEAREA+4           WIJS NAAR HET OUDE OPSLAGGEBIED
         LM    R14,R12,12(R13)          HERSTEL DE REGISTERS
         LA    R15,0                    RETURN CODE = 0
         BR    R14                      TERUG NAAR OPERATING SYSTEM
***********************************************************************
*
*   WORKING STORAGE AREA - DYNAMIC
*
***********************************************************************
SAVEAREA DS    18F'0'
OREC     DS    0CL60      1-60    Master record
ONBR     DS    CL5        1- 5    Customer nbr
OLNAME   DS    CL10       6-15    Last name
OFNAME   DS    CL10      16-25    First name
OADDR    DS    CL15      26-40    Address
OCITY    DS    CL10      41-50    City
OSTATE   DS    CL2       51-52    State
OZIP     DS    CL5       53-57    Zip
         DS    CL2       58-59    Unused
OACD     DS    CL1       60-60    Transaction code (A/C/D)
DATA1    DC    C'123456'
MYDATA   DS    0CL80         * Begin van datastructuur
LEN      DS    AL2           * 2-byte lengteveld
DATA2    DS    CL78          * 78-byte tekstveld
         END PGM1
