//HERC03T JOB  MSGCLASS=H,NOTIFY=HERC03
//STEP1  EXEC ASMFCLG
//SYSIN  DD *
R0       EQU 0
R1       EQU 1
R2       EQU 2
R3       EQU 3
R4       EQU 4
R5       EQU 5
R6       EQU 6
R7       EQU 7
R8       EQU 8
R9       EQU 9
R10      EQU 10
R11      EQU 11
R12      EQU 12
R13      EQU 13
R14      EQU 14
R15      EQU 15
***********************************************************************
PGM1     CSECT
         SAVE  (14,12)               SLA DE REGISTERS VAN DE AANROEP OP
         BALR  R12,0                      STEL R12 IN ALS BASISREGISTER
         USING *,R12                              GEBRUIK R12 ALS BASIS
         LA    R2,SAVEAREA                  ADRES VAN MIJN OPSLAGGEBIED
         ST    R2,8(,R13)                OPSLAAN GEHEUGEN ADRES R13 + 8
         ST    R13,SAVEAREA+4         WAARDE VAN R13 ADRES SAVEAREA + 4
         LR    R13,R2                   STEL 13 IN OP MIJN SUB-OPROEPEN
***********************************************************************
         WTO 'WELCOME TO ASM LEARNING'
         LA    R2,EMSG4
         WTO   TEXT=(R2)
***********************************************************************
A90END   L     R13,SAVEAREA+4           WIJS NAAR HET OUDE OPSLAGGEBIED
         LM    R14,R12,12(R13)          HERSTEL DE REGISTERS
         LA    R15,0                    RETURN CODE = 0
         BR    R14                      TERUG NAAR OPERATING SYSTEM
***********************************************************************
SAVEAREA DS  18F
***********************************************************************
*
*        LITERAL POOL - THE PROGRAM DOES NOT USE LITERALS
*
***********************************************************************
EMSG4    DC    AL2(L'EMSG4T)
EMSG4T   DC    C'UMDIR04 - RTFOUT OPEN FAILED'
*        LTORG *
         END PGM1
