//HERC03T JOB  MSGCLASS=H,NOTIFY=HERC03
//STEP1  EXEC ASMFCLG
//SYSIN  DD *
         PRINT NOGEN
         START 0
         BALR  12,0
         USING *,12
         WTO   'START PROGRAMMA'
         WTO   'EINDE PROGRAMMA'
         BR    14
         END
MSG      DC    C'HELLO FROM MVS 3.8'
