//HERC03T JOB  MSGCLASS=H,NOTIFY=HERC03
//STEP1   EXEC ASMFCLG
//SYSIN   DD *
         BALR  R12,0
         USING *,R12
         L     R1,A        LOAD VALUE OF A INTO R1
         L     R2,B        LOAD VALUE OF B INTO R2
         CR    R1,R2       COMPARE A AND B
         BH    PRINTA      BRANCH TO PRINTA IF A > B
PRINTB   WTO   'B IS GROTER OF GELIJK AAN A'
         WTO   BMSG        PRINT VALUE OF B
         B     DONE
PRINTA   WTO   'A IS GROTER DAN B'
         WTO   AMSG        PRINT VALUE OF A
DONE     BR    R14         RETURN
A        DC    F'10'       EXAMPLE VALUE FOR A
B        DC    F'5'        EXAMPLE VALUE FOR B
AMSG     DC    C'A = 10'
BMSG     DC    C'B = 5'
R0       EQU    0
R1       EQU    1
R2       EQU    2
R3       EQU    3
R4       EQU    4
R5       EQU    5
R6       EQU    6
R7       EQU    7
R8       EQU    8
R9       EQU    9
R10      EQU    10
R11      EQU    11
R12      EQU    12
R13      EQU    13
R14      EQU    14
R15      EQU    15
         END
