//HERC03T  JOB  MSGCLASS=H,NOTIFY=HERC03
//VERTCOB  EXEC PROC=VERTCOB,PGMNAME='COBOL1'
//RUN      EXEC PROC=RUN,PGMNAME='COBOL1'
//INPUT1   DD DISP=SHR,DSN=HERC03.TEST.INPUT1
//OUTPUT1  DD DSN=HERC03.TEST.OUTPUT1,
//         DCB=(BLKSIZE=27920,LRECL=80,RECFM=FB),
//         SPACE=(TRK,(10,10),RLSE),
//         DISP=(MOD,CATLG),
//         UNIT=SYSDA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
