//HERC03T     JOB MSGCLASS=H,NOTIFY=HERC03                              00000109
//HELLO       EXEC COBUCLG                                              00000204
//SYSPRINT    DD SYSOUT=*                                               00000304
//SYSOUT      DD SYSOUT=A                                               00000404
//COB.SYSIN   DD DISP=SHR,DSNAME=HERC03.COBOL.SOURCE(HELLO)             00000504
//LKED.SYSLIB DD DISP=SHR,DSNAME=SYS1.COBLIB                            00000604
//            DD DISP=SHR,DSNAME=SYS1.LINKLIB                           00000704
//GO.SYSPRINT DD SYSOUT=A                                               00000800
