//HERC03L JOB CLASS=A,MSGCLASS=H,NOTIFY=HERC03,REGION=8M                00000108
//GCCCG  EXEC GCCCG,INFILE='HERC03.C.SOURCE(HELLO)'                     00000208
