//HERC03T  JOB  MSGCLASS=H,NOTIFY=HERC03
//VERTASM  EXEC PROC=VERTASM,PGMNAME=READFILE
//RUN      EXEC PROC=RUN,PGMNAME=READFILE
//FILEIN   DD DISP=SHR,DSN=HERC03.TEST.INPUT1
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
