//HERC03T  JOB  MSGCLASS=H,NOTIFY=HERC03                                00000102
//REXX     EXEC RXBATCH                                                 00000204
