         PRINT NOGEN
         TITLE 'DISPLAY ARNO VARIABLE'
MYPGM    START 0
         USING *,12
ARNO     DC    CL4'ARNO'       DEFINE A 4-CHARACTER VARIABLE
MSG      DC    CL20' '         MESSAGE BUFFER
         MVC   MSG(4),ARNO     MOVE ARNO INTO MSG BUFFER
         WTO   TEXT=MSG        WRITE MSG TO CONSOLE
         END   MYPGM
